app/views/users/show_like.html.erb

      <span><%= link_to "view my profile", @user %></span>
      <span><b>Microposts:</b> <%= @user.microposts.count %></span>
---
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 2