app/helpers/sessions_helper.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id])

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` IS NULL LIMIT 1
---
  def current_micropost
    @current_micropost ||= Micropost.find_by(id: session[:micropost_id])