app/views/microposts/_microposts.html.erb

        <p class="mt-5">コメント一覧</p>
        <% micropost.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`micropost_id` = 1