app/views/microposts/_unlike.html.erb

SELECT  `favorite_relationships`.* FROM `favorite_relationships` WHERE `favorite_relationships`.`user_id` = 2 AND `favorite_relationships`.`micropost_id` = 3 LIMIT 1
---
<%= form_for(current_user.favorite_relationships.find_by(micropost_id: micropost.id),
    html: { method: :delete }) do |f| %>