app/controllers/comments_controller.rb

  def create
    micropost = Micropost.find(params[:micropost_id])
    @comment = micropost.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 6 LIMIT 1
INSERT INTO `comments` (`user_id`, `micropost_id`, `content`, `created_at`, `updated_at`) VALUES (1, 6, 'a', '2020-04-11 13:32:44', '2020-04-11 13:32:44')