app/controllers/favorite_relationships_controller.rb

SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 3 LIMIT 1
---
  def create
    micropost = Micropost.find(params[:micropost_id])

SELECT  `favorite_relationships`.* FROM `favorite_relationships` WHERE `favorite_relationships`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 3 LIMIT 1
---
  def destroy
    micropost = FavoriteRelationship.find(params[:id]).micropost