app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('a', 2, '2020-01-26 05:11:51', '2020-01-26 05:11:51')

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 2

  def correct_user
    @micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 2 AND `microposts`.`id` = 2 LIMIT 1