app/controllers/users_controller.rb

  def index
    @users = User.order(id: :desc).page(params[:page]).per(25)
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 25 OFFSET 0

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.order(id: :desc).page(params[:page])
    counts(@user)

    @micropost = Micropost.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 2 ORDER BY `microposts`.`id` DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `microposts` INNER JOIN `favorite_relationships` ON `microposts`.`id` = `favorite_relationships`.`micropost_id` WHERE `favorite_relationships`.`user_id` = 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 LIMIT 1

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('test', 'test@gmail.com', '$2a$12$..RZkFd1hWWn5S/7vKUTNub4iSDFpX.SFUkfwIp5PyqGBD3YT15J.', '2020-03-08 13:21:31', '2020-03-08 13:21:31')

  def followings
    @user = User.find(params[:id])
    @followings = @user.followings.page(params[:page])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def followers
    @user = User.find(params[:id])
    @followers = @user.followers.page(params[:page])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def likes
    @title = "Likes"
    @user  = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1